cubePiston/case/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
8239
(
0.00702973
0.00594055
0.00702972
0.00575519
0.00480973
0.00646479
0.00669835
0.00377701
...
)
;

boundaryField
{
    injectionXMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 2(-0.02 -0.02);
    }
    injectionXPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 2(-0.02 -0.02);
    }
    injectionYMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 2(-0.02 -0.02);
    }
    injectionYPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 2(-0.02 -0.02);
    }
    inletXMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
)
;
    }
    inletXPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
)
;
    }
    inletYMinus
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
)
;
    }
    inletYPlus
    {
        type            calculated;
        value           nonuniform List<scalar> 
12
(
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
-0.01
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
0.0255997
0.0255996
0.0255996
0.0255996
0.0255997
0.0255996
0.0255996
0.0255996
...
)
;
    }
    valve
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
